app/controllers/posts_controller.rb

INSERT INTO "posts" ("username", "title", "topic", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["username", "jk"], ["title", "l"], ["topic", "po"], ["body", "mpo;m"], ["created_at", "2024-09-06 19:48:56.585202"], ["updated_at", "2024-09-06 19:48:56.585202"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "username" = ?, "title" = ?, "topic" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["username", "oflsmfdo"], ["title", "ndsklm"], ["topic", "fwdslmp"], ["body", "mflksd"], ["updated_at", "2024-09-07 08:04:55.407954"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)